"""
姓名,数学成绩,英语成绩,语文成绩
"""
d1 = {"姓名":"张三","数学":90,"英语":80,"语文":70}
d2 = {"姓名":"李四","数学":60,"英语":95,"语文":90}
# 获取d1的英语成绩
print(d1["英语"])
# 设置总成绩 添加字段
d1["总成绩"] = d1["数学"]+d1["英语"]+d1["语文"]
d2["总成绩"] = d2["数学"]+d2["英语"]+d2["语文"]
# 修改英语成绩为100分 有字段则修改,没有字段则添加
d1["英语"]=100
d1["历史"]=100
# 删除
del d1["历史"]
# 通过方法 第一个参数 键, 第二个参数, 如果没有对应的键,返回第二个参数的值
print("获取成绩",d1.get("历史",100))
#print("删除语文")
#d1.pop("语文")
#修改同时修改姓名和数学成绩
d1.update([("姓名","王五"),("数学",60)])
# 把两个学生存放到list集合
list01 = [d1,d2]
for item in list01:
    print(item)
# print(d1)
# print(d2)
# in 在dict字典中,用来判断key是否存在
print("姓名" in d1)
# 获取所有的key
print("keys:",d1.keys())
# 获取所有的value
print("values",d1.values())
# 获取所有的键值对
print("键值对",d1.items())


